dylan-luo/NXP_MPC57XX_Demo/mpc5775e_dspi_dma_demo/mpc5775e_dspi_dma_demo_Z7_0/Project_Settings/Startup_Code/startup_MPC5775E.S
/* ---------------------------------------------------------------------------------------*/
/*  @file:    startup_MPC5775E.S                                                          */
/*  @purpose: GNU Compiler Collection Startup File                                        */
/*            MPC5775E                                                                    */
/*  @version: 1.0                                                                         */
/*  @date:    2017-2-9                                                                    */
/*  @build:   #                                                                           */
/* ---------------------------------------------------------------------------------------*/
/*                                                                                        */
/* Copyright 2018-2019 NXP                                                                */
/* All rights reserved.                                                                   */
/*                                                                                        */
/* THIS SOFTWARE IS PROVIDED BY NXP "AS IS" AND ANY EXPRESSED OR                          */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES              */
/* OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.                */
/* IN NO EVENT SHALL NXP OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT,                    */
/* INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES                     */
/* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR                     */
/* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)                     */
/* HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,                    */
/* STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING                  */
/* IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF                         */
/* THE POSSIBILITY OF SUCH DAMAGE.                                                        */
/*****************************************************************************/
/* Version: GNU Compiler Collection                                          */

/* ----------------------------------------------------------------------------
   -- Boot header configuration
   ---------------------------------------------------------------------------- */
#define MPC57xx_ID    0x005A0000
#define VLE_ENABLE    0x01000000
#define RCHW_VAL      (MPC57xx_ID | VLE_ENABLE)

#ifndef I_CACHE
#define I_CACHE
#endif
#ifndef ICACHE_ENABLE
#define ICACHE_ENABLE 0
#endif

#ifndef D_CACHE
#define D_CACHE
#endif
#ifndef DCACHE_ENABLE
#define DCACHE_ENABLE 0
#endif

#ifndef DISABLE_WDOG
#define DISABLE_WDOG  1
#endif
#ifndef SWT_COUNT
#define SWT_COUNT     2
#endif
#ifndef SWT_BASE_ADDR
#define SWT_BASE_ADDR   0xFFF34000
#endif

/* Init table */
    .section .init_table, "a"
    .long 5
    .long __VECTOR_TABLE
    .long __VECTOR_RAM
    .long __VECTOR_TABLE_COPY_END
    .long __CUSTOM_ROM
    .long __CUSTOM_RAM
    .long __CUSTOM_END
    .long __DATA_ROM
    .long __DATA_RAM
    .long __DATA_END
    .long __SDATA_ROM
    .long __SDATA_RAM
    .long __SDATA_END
    .long __CODE_ROM
    .long __CODE_RAM
    .long __CODE_END
/* Zero table */
    .section .zero_table, "a"
    .long 2
    .long __SBSS_START
    .long __SBSS_END
    .long __BSS_START
    .long __BSS_END

#ifdef TURN_ON_CPU0
    .section .cpu0_reset_vector, "a"
    .long       __start

    .section .rchw, "a"
        .long RCHW_VAL
#endif

    .section .startup, "ax"

    .globl    _start
    .globl    Reset_Handler


Reset_Handler:
_start:
    wrteei 0    ;# Disable interrupts
#if defined(MMU_CONFIG)
;#****************************** MMU configuration ********************************
    e_lis r3, 0x1003
    mtspr 624, r3

    e_lis r4, 0xC000
    e_or2i r4, 0x0480
    mtspr 625, r4

    e_lis r5, 0x4000
    e_or2i r5, 0x0020
    mtspr 626, r5

    e_lis r6, 0x4000
    e_or2i r6, 0x003f
    mtspr 627, r6

    tlbwe

    e_lis r3, 0x1001
    mtspr 624, r3

    e_lis r4, 0xC000
    e_or2i r4, 0x0700
    mtspr 625, r4

    e_lis r5, 0x0000
    e_or2i r5, 0x0020
    mtspr 626, r5

    e_lis r6,0x0000
    e_or2i r6, 0x003f
    mtspr 627, r6

    tlbwe

    e_lis r3, 0x1000
    mtspr 624, r3

    e_lis r4, 0xC000
    e_or2i r4, 0x0580
    mtspr 625, r4

    e_lis r5, 0xFFE0
    e_or2i r5, 0x002A
    mtspr 626, r5

    e_lis r6, 0xFFE0
    e_or2i r6, 0x003f
    mtspr 627, r6

    tlbwe

    e_lis r3, 0x1002
    mtspr 624, r3

    e_lis r4, 0xC000
    e_or2i r4, 0x0700
    mtspr 625, r4

    e_lis r5, 0x2000
    e_or2i r5, 0x0020
    mtspr 626, r5

    e_lis r6,0x0000
    e_or2i r6, 0x003f
    mtspr 627, r6

    tlbwe

    e_lis r3, 0x1004
    mtspr 624, r3

    e_lis r4, 0xC000
    e_or2i r4, 0x0580
    mtspr 625, r4

    e_lis r5, 0xC3E0
    e_or2i r5, 0x002A
    mtspr 626, r5

    e_lis r6, 0xC3E0
    e_or2i r6, 0x003f
    mtspr 627, r6

    tlbwe
#endif

;#*********************** Turn off Core Watchdog Timer*************************
        e_li    r3, 0x0000
        mtspr    340, r3

;#********************************* Enable BTB ********************************
;# Flush & Enable BTB - Set BBFI bit in BUCSR
    e_li      r3, 0x201
    mtspr     1013, r3
    se_isync

;#**************************** Init Core Registers ****************************
;# The E200Z7 core needs its registers initialising before they are used
;# otherwise in Lock Step mode the two cores will contain different random data.
;# If this is stored to memory (e.g. stacked) it will cause a Lock Step error.

;# GPRs 0-31
    e_li    r0, 0
    e_li    r1, 0
    e_li    r2, 0
    e_li    r3, 0
    e_li    r4, 0
    e_li    r5, 0
    e_li    r6, 0
    e_li    r7, 0
    e_li    r8, 0
    e_li    r9, 0
    e_li    r10, 0
    e_li    r11, 0
    e_li    r12, 0
    e_li    r13, 0
    e_li    r14, 0
    e_li    r15, 0
    e_li    r16, 0
    e_li    r17, 0
    e_li    r18, 0
    e_li    r19, 0
    e_li    r20, 0
    e_li    r21, 0
    e_li    r22, 0
    e_li    r23, 0
    e_li    r24, 0
    e_li    r25, 0
    e_li    r26, 0
    e_li    r27, 0
    e_li    r28, 0
    e_li    r29, 0
    e_li    r30, 0
    e_li    r31, 0

;# Init any other CPU register which might be stacked (before being used).

