dylan-luo/NXP_MPC57XX_Demo/mpc5775e_dspi_dma_demo/mpc5775e_dspi_dma_demo_Z7_0/Project_Settings/Startup_Code/startup_MPC5775E.S
    mtspr    1, r1          ;#XER
    mtcrf    0xFF, r1
    mtspr    CTR, r1
    mtspr    272, r1        ;#SPRG0
    mtspr    273, r1        ;#SPRG1
    mtspr    274, r1        ;#SPRG2
    mtspr    275, r1        ;#SPRG3
    mtspr    58, r1         ;#CSRR0
    mtspr    59, r1         ;#CSRR1
    mtspr    570, r1        ;#MCSRR0
    mtspr    571, r1        ;#MCSRR1
    mtspr    61, r1         ;#DEAR
    mtspr    63, r1         ;#IVPR
    mtspr    256, r1        ;#USPRG0
    mtspr    62, r1         ;#ESR
    mtspr    8, r31         ;#LR

;#***************************** DISABLE WATCHDOG *****************************
#if DISABLE_WDOG
    e_lis   r4, SWT_BASE_ADDR@h   ;# Initialize the base address of SWT_0
    e_or2i  r4, SWT_BASE_ADDR@l

    e_li    r5, SWT_COUNT@l
    mtctr   r5                    ;# Move to counter number of SWT instances

disable_swt:
    e_li    r3, 0xC520
    e_stw   r3, 0x10(r4)          ;# Write the watchdog unlock value 0xc520

    e_li    r3, 0xD928
    e_stw   r3, 0x10(r4)          ;# Write the watchdog unlock value 0xD928

    e_lis   r3, 0xFF00
    e_or2i  r3, 0x010A
    e_stw   r3, 0(r4)             ;# Write reset value with SWT disabled

    e_addi  r4,r4, 0x4000         ;# Increase the pointer to the next instance of SWT
    e_bdnz  disable_swt           ;# Loop for all instance of SWT
#endif

;#***************************** Initialise SRAM ECC **************************
;# Store number of 128Byte (32GPRs) segments in Counter
    e_lis       r5, __SRAM_SIZE@h  # Initialize r5 to size of SRAM (Bytes)
    e_or2i      r5, __SRAM_SIZE@l
    e_srwi      r5, r5, 0x7         ;# Divide SRAM size by 128
    mtctr       r5                  ;# Move to counter for use with "bdnz"

;# Base Address of the internal SRAM
    e_lis       r5, __SRAM_BASE_ADDR@h
    e_or2i      r5, __SRAM_BASE_ADDR@l

;# Fill SRAM with writes of 32GPRs
sram_loop:
    e_stmw      r0, 0(r5)           ;# Write all 32 registers to SRAM
    e_addi      r5, r5, 128         ;# Increment the RAM pointer to next 128bytes
    e_bdnz      sram_loop           ;# Loop for all of SRAM


;#******************** Clear reservations on external interrupt *****************
;# Set ICR in HID0
    e_lis     r3, 0x2
    mtspr     1008, r3
    se_isync

;#*************************** Enable ME Bit in MSR *****************************
    mfmsr    r6
    e_or2i   r6, 0x1000
    mtmsr    r6

#if defined(I_CACHE) && (ICACHE_ENABLE == 1)
;#****************** Invalidate and Enable the Instruction cache **************
__icache_cfg:
    e_li     r5, 0x2
    mtspr    1011, r5

    e_li     r7, 0x4
    e_li     r8, 0x2
    e_lis    r11, 0xFFFF
    e_or2i   r11, 0xFFFB

__icache_inv:
    mfspr    r9, 1011
    and.     r10, r7, r9
    e_beq    __icache_no_abort
    and.     r10, r11, r9
    mtspr    1011, r10
    e_b      __icache_cfg

__icache_no_abort:
    and.     r10, r8, r9
    e_bne    __icache_inv

    mfspr    r5, 1011
    e_ori    r5, r5, 0x0001
    se_isync
    mtspr    1011, r5
#endif

#if defined(D_CACHE) && (DCACHE_ENABLE == 1)
;#****************** Invalidate and Enable the Data cache **************
__dcache_cfg:
    e_li r5, 0x2
    mtspr 1010, r5

    e_li r7, 0x4
    e_li r8, 0x2
    e_lis    r11, 0xFFFF
    e_or2i   r11, 0xFFFB

__dcache_inv:
    mfspr r9, 1010
    and.  r10, r7, r9
    e_beq   __dcache_no_abort
    and.  r10, r11, r9
    mtspr 1010, r10
    e_b __dcache_cfg

__dcache_no_abort:
    and.  r10, r8, r9
    e_bne __dcache_inv

    mfspr r5, 1010
    e_ori   r5, r5, 0x0001
    se_isync
    msync
    mtspr 1010, r5
#endif

;#****************************** Initialize IVORs *****************************
;# Support for which cores do not set the IVORs automatically e.g. e200z759n3.
    e_lis       r0, VTABLE@ha
    e_add16i    r0, r0, VTABLE@l
    e_rlwinm    r0, r0, 0, 16, 27
    mtspr       400, r0                 ;# IVOR0 400 Critical input
    e_add16i    r3, r0, 0x010
    mtspr       401, r3                 ;# IVOR1 401 Machine check
    e_add16i    r3, r0, 0x020
    mtspr       402, r3                 ;# IVOR2 402 Data storage
    e_add16i    r3, r0, 0x030
    mtspr       403, r3                 ;# IVOR3 403 Instruction storage
    e_add16i    r3, r0, 0x040
    mtspr       404, r3                 ;# IVOR4 404 External input
    e_add16i    r3, r0, 0x050
    mtspr       405, r3                 ;# IVOR5 405 Alignment
    e_add16i    r3, r0, 0x060
    mtspr       406, r3                 ;# IVOR7 406 Program
    e_add16i    r3, r0, 0x070
    mtspr       407, r3                 ;# IVOR7 407 Floating-point unavailable
    e_add16i    r3, r0, 0x080
    mtspr       408, r3                 ;# IVOR8 408 System call
    e_add16i    r3, r0, 0x090
    mtspr       409, r3                 ;# IVOR9 409 Auxiliary processor unavailable. Not used by the e200z6.
    e_add16i    r3, r0, 0x0A0
    mtspr       410, r3                 ;# IVOR10 410 Decrementer
    e_add16i    r3, r0, 0x0B0
    mtspr       411, r3                 ;# IVOR11 411 Fixed-interval timer interrupt
    e_add16i    r3, r0, 0x0C0
    mtspr       412, r3                 ;# IVOR12 412 Watchdog timer interrupt
    e_add16i    r3, r0, 0x0D0
    mtspr       413, r3                 ;# IVOR13 413 Data TLB error
    e_add16i    r3, r0, 0x0E0
    mtspr       414, r3                 ;# IVOR14 414 Instruction TLB error
    e_add16i    r3, r0, 0x0F0
    mtspr       415, r3                 ;# IVOR15 415 Debug
;# IVOR16-IVOR31 - Reserved for future architectural use
    e_add16i    r3, r0, 0x100
    mtspr       528, r3                 ;# IVOR32 528 SPE APU unavailable
    e_add16i    r3, r0, 0x110
    mtspr       529, r3                 ;# IVOR33 529 SPE floating-point data exception
    e_add16i    r3, r0, 0x120
    mtspr       530, r3                 ;# IVOR34 530 SPE floating-point round exception
    e_add16i    r3, r0, 0x130
    mtspr       531, r3                 ;# IVOR35 531 Performance Monitor Interrupt

;#****************************** Configure Stack *****************************
    e_lis       r1, __SP_INIT@h         ;# Initialize stack pointer r1 to
    e_or2i      r1, __SP_INIT@l         ;# value in linker command file.

    e_lis       r13, _SDA_BASE_@h       ;# Initialize r13 to sdata base
    e_or2i      r13, _SDA_BASE_@l       ;# (provided by linker).

